InformationRegisters/ВидеоПоЗапросу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВидеоПоЗапросу</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СсылкаДляСкачивания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаДляПросмотра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленоНаПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерКассы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВидеоПоЗапросу/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Просмотр(Команда)
	П = Новый Структура("НомерЧека,НомерКассы,Тип");
	ЗаполнитьЗначенияСвойств(П,Элементы.Список.ТекущиеДанные);
	П.Вставить("IdЗаписи",Элементы.Список.ТекущиеДанные.ID);
	П.Тип = 10;
	ОткрытьФорму("Обработка.ПросмотрВидеоСКамер.Форма.Форма",П,ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВидеоПросмотрено(НомерКассы,НомерЧека,ИД)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидеоПоЗапросуСрезПоследних.НомерЧека,
	|	ВидеоПоЗапросуСрезПоследних.НомерКассы,
	|	ВидеоПоЗапросуСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.ВидеоПоЗапросу.СрезПоследних(
	|			,
	|			НомерКассы = &НомерКассы
	|				И НомерЧека = &НомерЧека
	|				И ID = &ИдЗаписи) КАК ВидеоПоЗапросуСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("НомерКассы",НомерКассы);
	Запрос.УстановитьПараметр("НомерЧека",НомерЧека);
	Запрос.УстановитьПараметр("ИдЗаписи",ИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.ВидеоПоЗапросу.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.Прочитать();
		Запись.Просмотрено=Истина;
		Запись.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") Тогда
		Если ИсточникВыбора.ИмяФормы = "Обработка.ПросмотрВидеоСКамер.Форма.Форма" Тогда
			Если ВыбранноеЗначение = Истина Тогда
				ВидеоПросмотрено(ИсточникВыбора.НомерКассы,ИсточникВыбора.НомерЧека,ИсточникВыбора.IdЗаписи);
				Элементы.Список.Обновить();
			КонецЕсли
		КонецЕсли
	КонецЕсли;
КонецПроцедуры
